Autodesk.Revit.DB.ExportLineweightInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.DestinationLineweightName
The destination lineweight name (the name of the line weight in the exported format)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.#ctor(System.String)
Constructs a new ExportLineweightInfo using the destination line weight name as input.
destinationLineweightName:
The destination line weight name (the name of the line weight in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.#ctor
Constructs a new default ExportLineweightInfo.
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo.#ctor(Autodesk.Revit.DB.ExportLineweightInfo)
Constructs a new copy of the input ExportLineweightInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLineweightInfo
A value used to represent the info stored in the Autodesk.Revit.DB.ExportLineweightTable.
Since:
2014